sterentev/atdf-device-asm-include/inc/ATmega169PA.inc
; ----------	Register SPSR bits		------------------------
.equ	SPIF		= 7		; 0x80 - SPI Interrupt Flag
.equ	WCOL		= 6		; 0x40 - Write Collision Flag
.equ	SPI2X		= 0		; 0x01 - Double SPI Speed Bit

; ----------	Register SPDR bits		------------------------
.equ	SPDR_MASK	= 0xFF		;      - SPI Data bits (8 bits)
.equ	SPDR0		= 0		;          SPDR BIT0 position



; ====	AC MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register ADCSRB bits		------------------------
.equ	ACME		= 6		; 0x40 - Analog Comparator Multiplexer Enable

; ----------	Register ACSR bits		------------------------
.equ	ACD		= 7		; 0x80 - Analog Comparator Disable
.equ	ACBG		= 6		; 0x40 - Analog Comparator Bandgap Select
.equ	ACO		= 5		; 0x20 - Analog Compare Output
.equ	ACI		= 4		; 0x10 - Analog Comparator Interrupt Flag
.equ	ACIE		= 3		; 0x08 - Analog Comparator Interrupt Enable
.equ	ACIC		= 2		; 0x04 - Analog Comparator Input Capture Enable
.equ	ACIS_MASK	= 0x03		;      - Analog Comparator Interrupt Mode Select bits (2 bits)
.equ	ACIS0		= 0		;          ACIS BIT0 position
; ::::  ACIS	:::: bitfield values
;			0x00		; Interrupt on Toggle
;			0x01		; Reserved
;			0x02		; Interrupt on Falling Edge
;			0x03		; Interrupt on Rising Edge

; ----------	Register DIDR1 bits		------------------------
.equ	AIN1D		= 1		; 0x02 - AIN1 Digital Input Disable
.equ	AIN0D		= 0		; 0x01 - AIN0 Digital Input Disable



; ====	JTAG MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register MCUCR bits		------------------------
.equ	JTD		= 7		; 0x80 - JTAG Interface Disable

; ----------	Register MCUSR bits		------------------------
.equ	JTRF		= 4		; 0x10 - JTAG Reset Flag



; ====	LCD MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register LCDCRA bits		------------------------
.equ	LCDEN		= 7		; 0x80 - LCD Enable
.equ	LCDAB		= 6		; 0x40 - LCD A or B waveform
.equ	LCDIF		= 4		; 0x10 - LCD Interrupt Flag
.equ	LCDIE		= 3		; 0x08 - LCD Interrupt Enable
.equ	LCDBD		= 2		; 0x04 - LCD Buffer Disable
.equ	LCDCCD		= 1		; 0x02 - LCD Contrast Control Disable
.equ	LCDBL		= 0		; 0x01 - LCD Blanking

; ----------	Register LCDCRB bits		------------------------
.equ	LCDCS		= 7		; 0x80 - LCD CLock Select
.equ	LCD2B		= 6		; 0x40 - LCD 1/2 Bias Select
.equ	LCDMUX_MASK	= 0x30		;      - LCD Mux Selects (2 bits)
.equ	LCDMUX0		= 4		;          LCDMUX BIT0 position
.equ	LCDPM_MASK	= 0x07		;      - LCD Port Masks (3 bits)
.equ	LCDPM0		= 0		;          LCDPM BIT0 position
; ::::  LCDPM	:::: bitfield values
;			0x00		; SEG0:12
;			0x01		; SEG0:14
;			0x02		; SEG0:15
;			0x03		; SEG0:18
;			0x04		; SEG0:20
;			0x05		; SEG0:22
;			0x06		; SEG0:23
;			0x07		; SEG0:24

; ----------	Register LCDFRR bits		------------------------
.equ	LCDPS_MASK	= 0x70		;      - LCD Prescaler Selects (3 bits)
.equ	LCDPS0		= 4		;          LCDPS BIT0 position
.equ	LCDCD_MASK	= 0x07		;      - LCD Clock Dividers (3 bits)
.equ	LCDCD0		= 0		;          LCDCD BIT0 position
; ::::  LCDPS	:::: bitfield values
;			0x00		; ClkLCD/16
;			0x10		; ClkLCD/64
;			0x20		; ClkLCD/128
;			0x30		; ClkLCD/256
;			0x40		; ClkLCD/512
;			0x50		; ClkLCD/1024
;			0x60		; ClkLCD/2048
;			0x70		; ClkLCD/4096
; ::::  LCDCD	:::: bitfield values
;			0x00		; 1
;			0x01		; 2
;			0x02		; 3
;			0x03		; 4
;			0x04		; 5
;			0x05		; 6
;			0x06		; 7
;			0x07		; 8

; ----------	Register LCDCCR bits		------------------------
.equ	LCDDC_MASK	= 0xE0		;      - LCD Display Configuration Bits (3 bits)
.equ	LCDDC0		= 5		;          LCDDC BIT0 position
.equ	LCDMDT		= 4		; 0x10 - LCD Maximum Drive Time
.equ	LCDCC_MASK	= 0x0F		;      - LCD Contrast Controls (4 bits)
.equ	LCDCC0		= 0		;          LCDCC BIT0 position
; ::::  LCDDC	:::: bitfield values
;			0x00		; 300us
;			0x20		; 70us
;			0x40		; 150us
;			0x60		; 450us
;			0x80		; 575us
;			0xA0		; 850us
;			0xC0		; 1150us
;			0xE0		; 50% of LCD clock
; ::::  LCDCC	:::: bitfield values
;			0x00		; 2.60V
;			0x01		; 2.65V
;			0x02		; 2.70V
;			0x03		; 2.75V
;			0x04		; 2.80V
;			0x05		; 2.85V
;			0x06		; 2.90V
;			0x07		; 2.95V
;			0x08		; 3.00V
;			0x09		; 3.05V
;			0x0A		; 3.10V
;			0x0B		; 3.15V
;			0x0C		; 3.20V
;			0x0D		; 3.25V
;			0x0E		; 3.30V
;			0x0F		; 3.35V



; ====	EXINT MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register EICRA bits		------------------------
.equ	ISC01		= 1		; 0x02 - External Interrupt Sense Control 0 Bit 1
.equ	ISC00		= 0		; 0x01 - External Interrupt Sense Control 0 Bit 0
; ::::  ISC00	>>>> This is a part of INTERRUPT_SENSE_CONTROL enum (see complete values list below)

; ----------	Register EIMSK bits		------------------------
.equ	PCIE_MASK	= 0x30		;      - Pin Change Interrupt Enables (2 bits)
.equ	PCIE0		= 4		;          PCIE BIT0 position
.equ	INT0		= 0		; 0x01 - External Interrupt Request 0 Enable

; ----------	Register EIFR bits		------------------------
.equ	PCIF_MASK	= 0x30		;      - Pin Change Interrupt Flags (2 bits)
.equ	PCIF0		= 4		;          PCIF BIT0 position
.equ	INTF0		= 0		; 0x01 - External Interrupt Flag 0

; ----------	Register PCMSK1 bits		------------------------
.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Masks (8 bits)
.equ	PCINT0		= 0		;          PCINT BIT0 position

; ----------	Register PCMSK0 bits		------------------------
;.equ	PCINT_MASK	= 0xFF		;      - Pin Change Enable Masks (8 bits)
;.equ	PCINT0		= 0		;          PCINT BIT0 position



; ====	CPU MODULE REGISTERS BITS DEFINITION		========
;
; ----------	Register SREG bits		------------------------
.equ	SREG_I		= 7		; 0x80 - Global Interrupt Enable
.equ	SREG_T		= 6		; 0x40 - Bit Copy Storage
.equ	SREG_H		= 5		; 0x20 - Half Carry Flag
.equ	SREG_S		= 4		; 0x10 - Sign Bit
.equ	SREG_V		= 3		; 0x08 - Two's Complement Overflow Flag
.equ	SREG_N		= 2		; 0x04 - Negative Flag
.equ	SREG_Z		= 1		; 0x02 - Zero Flag
.equ	SREG_C		= 0		; 0x01 - Carry Flag

; ----------	Register MCUCR bits		------------------------
.equ	BODS		= 6		; 0x40 - BOD Sleep
.equ	BODSE		= 5		; 0x20 - BOD Sleep Enable
.equ	PUD		= 4		; 0x10 - Pull-up disable
.equ	IVSEL		= 1		; 0x02 - Interrupt Vector Select
.equ	IVCE		= 0		; 0x01 - Interrupt Vector Change Enable

